[
  {
    "text": "What do ZK proofs mean for the future of crypto? 🔒\n\nThey keep you safe by enabling verification that never exposes your data.\n\nA private, verifiable internet means more capital moves onchain. Which means the market gets better for everyone.\n\nAnd ENTRY’s building the rails.",
    "created_at": "2025-11-12T14:00:00.000Z",
    "likes": 297,
    "retweets": 79,
    "replies": 268,
    "views": 0,
    "media": [
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5jw2PLa0AAt8_j.jpg",
        "description": "The image features the word \"ENTRY\" and phrases \"Proof. Privacy. Possibility.\" and \"Making zero-knowledge compliant\" next to a 3D illustration of a blue lock with a key, set against a blue gradient background."
      }
    ],
    "user": {
      "name": "",
      "username": "@entry_network",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/entry_network/status/1988607724285043031",
    "engagement_score": 723,
    "topic": "crypto"
  },
  {
    "text": "We are meeting the finance Minister ahead of the Budget presentation. Is there anything you want me to ask or bring up, send me a WhatsApp on 0244616215.",
    "created_at": "2025-11-12T12:07:00.000Z",
    "likes": 852,
    "retweets": 99,
    "replies": 142,
    "views": 0,
    "media": [],
    "user": {
      "name": "",
      "username": "@konkrumah",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/konkrumah/status/1988579429497569424",
    "engagement_score": 1192,
    "topic": "finance"
  },
  {
    "text": "Polymarket 🤝 Yahoo\n\nWe’re excited to announce Polymarket is now the exclusive prediction market partner for Yahoo Finance.",
    "created_at": "2025-11-12T13:41:00.000Z",
    "likes": 645,
    "retweets": 67,
    "replies": 231,
    "views": 0,
    "media": [],
    "user": {
      "name": "",
      "username": "@Polymarket",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/Polymarket/status/1988603156473991562",
    "engagement_score": 1010,
    "topic": "finance"
  },
  {
    "text": "Never bet against projects that solve real problems in the field.\n\nThrowback to a great conversation between our CEO, @0xshai, and @aescobarindo from @rhea_finance.\n\nCatch the full video in the comments.",
    "created_at": "2025-11-12T09:41:00.000Z",
    "likes": 203,
    "retweets": 155,
    "replies": 104,
    "views": 0,
    "media": [],
    "user": {
      "name": "",
      "username": "@FractionAI_xyz",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/FractionAI_xyz/status/1988542679081255138",
    "engagement_score": 617,
    "topic": "finance"
  },
  {
    "text": "Team Power, Real Rewards\n\n💥 The countdown to @itlx_defi is on, and this is your reminder: the future of trading isn’t solo. It’s collective.\n\nITLX is building a system where you can team up with others to earn real rewards in $USDC.\nEvery verified action from you and your network adds up, turning collaboration into measurable milestones.\n\nThis allows you to build your own model similar to a Broker Company in the crypto world, with almost zero cost and a stable monthly revenue stream generated through your team’s performance.\n\nWhether you’re just starting your journey or leading a growing squad, every move matters.\nEach transaction pushes your team closer to the next Tier, and each Tier means real, on-chain rewards waiting to be unlocked.\n\n Tier Milestones 👇\n🏆 Tier 1  $8 910 / Month\n🌐 Tier 2  $2 295 / Month\n🔥 Tier 3  $630 / Month\n⚡️ Tier 4  $210 / Month\n💎 Tier 5  $70 / Month\n🪙 Tier 6  $35 / Month\n\n💡 Note:\nWhen you reach a higher Tier, you can also receive the rewards from all lower Tiers, maximizing your total monthly earnings.\n\nHow your Tier is calculated:\nYour own trading volume + your direct team’s volume (F1) + 20% of your indirect team’s volume (F2).\n\nTogether, these layers form the ITLX ecosystem that rewards real people for real participation.\nNo bots. No speculation. Just verified network power, tracked transparently on-chain.\n\n⚙️ This isn’t just trading.\nIt’s about building a sustainable business model with your team, where long-term success is shared and powered by collective growth.\n\n#ITLX #ITLG #ITL",
    "created_at": "2025-11-12T14:19:00.000Z",
    "likes": 256,
    "retweets": 157,
    "replies": 137,
    "views": 0,
    "media": [
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5j4WVWXEAEyo-i.jpg",
        "description": "The image features a promotional graphic for \"ITLX Wallet\" titled \"Team Power, Real Rewards,\" highlighting a tiered reward system displayed on a smartphone screen. It emphasizes collective trading with visual metrics and tier progression, indicating that each transaction advances the team towards unlocking real, on-chain rewards."
      }
    ],
    "user": {
      "name": "",
      "username": "@itlx_defi",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/itlx_defi/status/1988612661576089803",
    "engagement_score": 707,
    "topic": "trading"
  },
  {
    "text": "Launched construction of the 20km Emali-Matiliku road, part of the 42km Emali-Ukia road, Ndundune, Makueni County.\n\nThe KSh1.1 billion project will open up key market access points by linking Kativani, Manywani, Matiliku, Kalamba, Nziu, and Ukia trading centres, and Wote town onward to Kajiado, Nairobi, and Mombasa.\n\nIt will reduce transport costs, expand trade in perishable goods and livestock products, and enable farmers to reach markets more quickly, cutting post-harvest losses and increasing their earnings.",
    "created_at": "2025-11-12T12:23:00.000Z",
    "likes": 315,
    "retweets": 67,
    "replies": 62,
    "views": 0,
    "media": [
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5jd-_RWYAAngCa.jpg",
        "description": "A large crowd surrounds a person standing on top of a vehicle, waving to the masses amidst lush trees and a bright blue sky. Security personnel are visible nearby, indicating a public event or rally."
      },
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5jd-_3XEAANPEi.jpg",
        "description": "A large crowd of people is gathered outdoors under sunny skies, with many raising their hands and some taking photos. There is a green wall in the background with the word \"Safaricom\" partially visible."
      },
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5jd-_NXEAAbmeS.jpg",
        "description": "A large crowd has gathered outdoors for a public event, with a person speaking into a microphone from the roof of a vehicle. In the background, a green wall displays partial text \"rican...Deza,\" possibly indicating a related location or organization."
      },
      {
        "type": "image",
        "url": "https://pbs.twimg.com/media/G5jd-_IXIAAa6YN.jpg",
        "description": "A man in a hard hat is waving a Kenyan flag at a construction site with a large crowd gathered around. A bulldozer is visible on a dirt road under a bright, partly cloudy sky."
      }
    ],
    "user": {
      "name": "",
      "username": "@WilliamsRuto",
      "followers": 0,
      "verified": true
    },
    "url": "https://x.com/WilliamsRuto/status/1988583345484185890",
    "engagement_score": 511,
    "topic": "trading"
  }
]